/*
 * @Author: zhao hong 
 * @Date: 2017-11-03 09:31:26 
 * @Last Modified by: zhao hong
 * @Last Modified time: 2017-12-21 16:16:03
 */



import React, { Component } from 'react';
import { render } from 'react-dom';
import ScrollBar from './js/ScrollBar';
import style from './index.less';


const Test  = () => {
    return (
        <div className="test">
            <ScrollBar height={500}>
                <p>人生需要规划，尤其是在25岁之后，如果还拎不清，胡里糊涂的，那么你明白的就太迟了。 请不要羡慕别人年纪轻轻，就拥有豪车别墅，也不要自责自己存款只有五位数，这一切只因为别人早就做了人生规划，而自己还弄不懂下面几件事： 关于未来 人生不存在一条既定的跑道 在</p>  <p>人生需要规划，尤其是在25岁之后，如果还拎不清，胡里糊涂的，那么你明白的就太迟了。 请不要羡慕别人年纪轻轻，就拥有豪车别墅，也不要自责自己存款只有五位数，这一切只因为别人早就做了人生规划，而自己还弄不懂下面几件事： 关于未来 人生不存在一条既定的跑道 在</p>  <p>人生需要规划，尤其是在25岁之后，如果还拎不清，胡里糊涂的，那么你明白的就太迟了。 请不要羡慕别人年纪轻轻，就拥有豪车别墅，也不要自责自己存款只有五位数，这一切只因为别人早就做了人生规划，而自己还弄不懂下面几件事： 关于未来 人生不存在一条既定的跑道 在</p>  <p>人生需要规划，尤其是在25岁之后，如果还拎不清，胡里糊涂的，那么你明白的就太迟了。 请不要羡慕别人年纪轻轻，就拥有豪车别墅，也不要自责自己存款只有五位数，这一切只因为别人早就做了人生规划，而自己还弄不懂下面几件事： 关于未来 人生不存在一条既定的跑道 在</p>  <p>人生需要规划，尤其是在25岁之后，如果还拎不清，胡里糊涂的，那么你明白的就太迟了。 请不要羡慕别人年纪轻轻，就拥有豪车别墅，也不要自责自己存款只有五位数，这一切只因为别人早就做了人生规划，而自己还弄不懂下面几件事： 关于未来 人生不存在一条既定的跑道 在</p>  <p>人生需要规划，尤其是在25岁之后，如果还拎不清，胡里糊涂的，那么你明白的就太迟了。 请不要羡慕别人年纪轻轻，就拥有豪车别墅，也不要自责自己存款只有五位数，这一切只因为别人早就做了人生规划，而自己还弄不懂下面几件事： 关于未来 人生不存在一条既定的跑道 在</p>  <p>人生需要规划，尤其是在25岁之后，如果还拎不清，胡里糊涂的，那么你明白的就太迟了。 请不要羡慕别人年纪轻轻，就拥有豪车别墅，也不要自责自己存款只有五位数，这一切只因为别人早就做了人生规划，而自己还弄不懂下面几件事： 关于未来 人生不存在一条既定的跑道 在</p>  <p>人生需要规划，尤其是在25岁之后，如果还拎不清，胡里糊涂的，那么你明白的就太迟了。 请不要羡慕别人年纪轻轻，就拥有豪车别墅，也不要自责自己存款只有五位数，这一切只因为别人早就做了人生规划，而自己还弄不懂下面几件事： 关于未来 人生不存在一条既定的跑道 在</p>
                <p>人生需要规划，尤其是在25岁之后，如果还拎不清，胡里糊涂的，那么你明白的就太迟了。 请不要羡慕别人年纪轻轻，就拥有豪车别墅，也不要自责自己存款只有五位数，这一切只因为别人早就做了人生规划，而自己还弄不懂下面几件事： 关于未来 人生不存在一条既定的跑道 在</p> 
            </ScrollBar>
        </div>
    );
};



    


    render(
        <Test></Test>,    
        document.getElementById('root'),
    );







